name: "ensemble_yolov5_face"
platform: "ensemble"
max_batch_size: 0

input [
  {
    name: "ENSEMBLE_IMAGE_INPUT"
    data_type: TYPE_FP32
    dims: [1, 3, -1, -1]
  },
  {
    name: "ENSEMBLE_FACE_DET_THRES"
    data_type: TYPE_FP32
    dims: [1]
  },
  {
    name: "ENSEMBLE_FACE_BBOX_AREA_THRES"
    data_type: TYPE_FP32
    dims: [1]
  }
]
output [
  {
    name: "ENSEMBLE_FACES"
    data_type: TYPE_FP32
    dims: [-1, 3, 112, 112]
  },
  {
    name: "ENSEMBLE_FACE_DETECTOR_BBOXES"
    data_type: TYPE_INT32
    dims: [-1, 4]
  },
  {
    name: "ENSEMBLE_FACE_DETECTOR_CONFS"
    data_type: TYPE_FP32
    dims: [-1, 1]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "yolov5s_face_detector"
      model_version: -1
      input_map {
        key: "images"
        value: "ENSEMBLE_IMAGE_INPUT"
      }
      output_map [
        {
          key: "stride_8"
          value: "yolov5_stride_8_out"
        },
        {
          key: "stride_16"
          value: "yolov5_stride_16_out"
        },
        {
          key: "stride_32"
          value: "yolov5_stride_32_out"
        }
      ]
    },
    {
      model_name: "yolov5_face_postprocess"
      model_version: -1
      input_map [
        {
          key: "images"
          value: "ENSEMBLE_IMAGE_INPUT"
        },
        {
          key: "face_det_thres"
          value: "ENSEMBLE_FACE_DET_THRES"
        },
        {
          key: "face_bbox_area_thres"
          value: "ENSEMBLE_FACE_BBOX_AREA_THRES"
        },
        {
          key: "stride_8_out"
          value: "yolov5_stride_8_out"
        },
        {
          key: "stride_16_out"
          value: "yolov5_stride_16_out"
        },
        {
          key: "stride_32_out"
          value: "yolov5_stride_32_out"
        }
      ]
      output_map [
        {
          key: "face_detector_faces"
          value: "ENSEMBLE_FACES"
        },
        {
          key: "face_detector_bboxes"
          value: "ENSEMBLE_FACE_DETECTOR_BBOXES"
        },
        {
          key: "face_detector_confs"
          value: "ENSEMBLE_FACE_DETECTOR_CONFS"
        }
      ]
    }
  ]
}
